app/controllers/users_controller.rb

  def create
    @user = User.new(params[:user])

    respond_to do |format|
      if @user.save
---
INSERT INTO `users` (`encrypted_password`, `created_at`, `confirmation_sent_at`, `updated_at`, `password_salt`, `reset_password_token`, `remember_token`, `confirmation_token`, `remember_created_at`, `email`, `confirmed_at`) VALUES('de444381a39615b6016cc522d3986e9a31a5c9bc', '2010-04-16 03:39:03', '2010-04-16 03:39:03', '2010-04-16 03:39:03', 'aAhadzbVOd3oI5IM-SFk', NULL, NULL, 'Vary7s1__s3KqO-LfVZt', NULL, 'joel@fake.com', NULL)