app/controllers/votes_controller.rb

  def create
    # Only the current user can vote
    params[:vote] = params[:vote].merge({:user_id => current_user.id})

    @vote = Vote.new(params[:vote])



    if request.xhr?
      if @vote.save
---
INSERT INTO `votes` (`comment`, `created_at`, `event_id`, `updated_at`, `user_id`, `type`) VALUES(NULL, '2010-04-24 22:31:30', 980190963, '2010-04-24 22:31:30', 0, 'VoteUp')